app/controllers/authors_controller.rb

INSERT INTO "authors" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2018-02-21 15:12:15.381300"], ["updated_at", "2018-02-21 15:12:15.381300"]]
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", nil]]
---
  def show
    if !params[:id]
      @author = Author.create(name: "Test", genre: "Classic", bio: "This is a bit about me")
    else
      @author = Author.find(params[:id])

INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Joshua"], ["created_at", "2018-02-20 20:19:28.128814"], ["updated_at", "2018-02-20 20:19:28.128814"]]
---
  def create
    @author = Author.new(author_params)
    if @author.save